app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();
        $data['records'] = $model->findAll();
---
SELECT *
FROM `users`

    public function delete($id)
    {
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('5')